<dedication>
<title>Recomendaciones iniciales </title>
<para> En este apartado se presentan algunas recomendaciones que pueden facilitar la lectura de este manual y la comprensi&oacute;n de la oferta de ALBA: </para>

<para> Antes de comenzar es importante acordar sobre las definiciones de algunos de los conceptos que se utilizan a lo largo del manual, y que pueden consultarse en el cap&iacute;tulo tres. </para>
<para>
Este documento se encuentra tambi&eacute;n disponible para descarga en: http://www.proyectoalba.com.ar/manual_alba_gestionescolar.pdf. Adem&aacute;s de este manual el propio sistema posee esta ayuda disponible tambi&eacute;n desde el men&uacute; para facilitar su uso.
</para>
<para>
El manual cuenta con varios apartados que resumen y simplifican la informaci&oacute;n completa, para facilitar su lectura o consultas espec&iacute;ficas. Es posibl,e antes de completar la revisi&oacute;n de este documento, avanzar desde el cap&iacute;tulo cuarto. A partir del cinco, cada uno de los cap&iacute;tulos representa una sección del menú de la aplicaci&oacute;n.
</para>
<para>
ALBA, est&aacute; desarrollado para contemplar la posibilidad de la gesti&oacute;n de varios establecimientos de una misma empresa (en el caso de tratarse de privados) que se denomina en esta aplicaci&oacute;n "organizaci&oacute;n". De todas formas puede utilizarse en escuelas p&uacute;blicas sin mayores dificultades.
</para>
<para>
Los primeros m&oacute;dulos desarrollados y que se explican en este documento son parte de un proyecto m&aacute;s ambicioso que contemple a medida que avanza, diferentes niveles de ense&ntilde;anza. Si Ud. tiene alg&uacute;n tipo de instituci&oacute;n educativa no contemplada, es posible contactarse para solicitar cambios a medida de las necesidades. 
</para>
<para>
Recuerde que al tratarse de Software Libre (licenciado con la Licencia P&uacute;blica General - GPL) el sistema se pone a disposici&oacute;n junto a su c&oacute;digo fuente (instrucciones codificadas que son inteligibles para el hombre) lo que permite la modificaci&oacute;n del mismo por parte de cualquier profesional en el lenguaje.
</para>
<para>
El modelo del Software Libre propone una interacci&oacute;n directa entre usuarios y desarrolladores, por lo que ante cualquier error o sugerencia es posible comunicarse con el equipo de desarrollo a contacto@proyectoalba.com.ar
</para>
<para>
&iexcl;Disfrute de la lectura!
</para>
</dedication>